RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Src/stm32wlxx_hal_rcc_ex.c
    case LL_RCC_USART1_CLKSOURCE_HSI:             /* USART1 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_USART1_CLKSOURCE_LSE:             /* USART1 Clock is LSE Osc. */
      if (LL_RCC_LSE_IsReady() == 1U)
      {
        frequency = LSE_VALUE;
      }
      break;
      
    case LL_RCC_USART1_CLKSOURCE_PCLK2:           /* USART1 Clock is PCLK2 */
    default:
      frequency = __LL_RCC_CALC_PCLK2_FREQ(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), \
        LL_RCC_GetAHBPrescaler()), LL_RCC_GetAPB2Prescaler());
      break;
    }
    break;
    
  case RCC_PERIPHCLK_USART2:
    
    /* Get the current USART2 source */
    srcclk = LL_RCC_GetUSARTClockSource(LL_RCC_USART2_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_USART2_CLKSOURCE_SYSCLK:          /* USART2 Clock is System Clock */
      frequency = HAL_RCC_GetSysClockFreq();
      break;
      
    case LL_RCC_USART2_CLKSOURCE_HSI:             /* USART2 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_USART2_CLKSOURCE_LSE:             /* USART2 Clock is LSE Osc. */
      if (LL_RCC_LSE_IsReady() == 1U)
      {
        frequency = LSE_VALUE;
      }
      break;
      
    case LL_RCC_USART2_CLKSOURCE_PCLK1:           /* USART2 Clock is PCLK1 */
    default:
      frequency = __LL_RCC_CALC_PCLK1_FREQ(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), \
        LL_RCC_GetAHBPrescaler()), LL_RCC_GetAPB1Prescaler());
      break;
    }
    break;
    
  case RCC_PERIPHCLK_LPUART1:
    
    /* Get the current LPUART1 source */
    srcclk = LL_RCC_GetLPUARTClockSource(LL_RCC_LPUART1_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_LPUART1_CLKSOURCE_SYSCLK:         /* LPUART1 Clock is System Clock */
      frequency = HAL_RCC_GetSysClockFreq();
      break;
      
    case LL_RCC_LPUART1_CLKSOURCE_HSI:            /* LPUART1 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_LPUART1_CLKSOURCE_LSE:            /* LPUART1 Clock is LSE Osc. */
      if (LL_RCC_LSE_IsReady() == 1U)
      {
        frequency = LSE_VALUE;
      }
      break;
      
    case LL_RCC_LPUART1_CLKSOURCE_PCLK1:          /* LPUART1 Clock is PCLK1 */
    default:
      frequency = __LL_RCC_CALC_PCLK1_FREQ(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), \
        LL_RCC_GetAHBPrescaler()), LL_RCC_GetAPB1Prescaler());
      break;
    }
    
    break;
    
  case RCC_PERIPHCLK_ADC:
    
    /* Get the current ADC source */
    srcclk = LL_RCC_GetADCClockSource(LL_RCC_ADC_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_ADC_CLKSOURCE_HSI:                /* HSI Osc. used as ADC clock source  */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
      
    case LL_RCC_ADC_CLKSOURCE_SYSCLK:             /* SYSCLK clock used as ADC clock source */
      frequency = HAL_RCC_GetSysClockFreq();
      break;
      
    case LL_RCC_ADC_CLKSOURCE_PLL:                /* PLL clock used as ADC clock source */
      if (LL_RCC_PLL_IsReady() == 1U)
      {
        frequency = RCC_PLL_GetFreqDomain_P();
      }
      break;
      
    case LL_RCC_ADC_CLKSOURCE_NONE:               /* No clock used as ADC clock source */
    default:
      /* No clock source, frequency default init at 0 */
      break;
    }
    break;
    
  case RCC_PERIPHCLK_I2C1:
    
    /* Get the current I2C1 source */
    srcclk = LL_RCC_GetI2CClockSource(LL_RCC_I2C1_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_I2C1_CLKSOURCE_SYSCLK:            /* I2C1 Clock is System Clock */
      frequency = HAL_RCC_GetSysClockFreq();
      break;
      
    case LL_RCC_I2C1_CLKSOURCE_HSI:               /* I2C1 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_I2C1_CLKSOURCE_PCLK1:             /* I2C1 Clock is PCLK1 */
    default:
      frequency = __LL_RCC_CALC_PCLK1_FREQ(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), \
        LL_RCC_GetAHBPrescaler()), LL_RCC_GetAPB1Prescaler());
      break;
    }
    break;
    
  case RCC_PERIPHCLK_I2C2:
    
    /* Get the current I2C2 source */
    srcclk = LL_RCC_GetI2CClockSource(LL_RCC_I2C2_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_I2C2_CLKSOURCE_SYSCLK:            /* I2C2 Clock is System Clock */
      frequency = HAL_RCC_GetSysClockFreq();
      break;
      
    case LL_RCC_I2C2_CLKSOURCE_HSI:               /* I2C2 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_I2C2_CLKSOURCE_PCLK1:             /* I2C2 Clock is PCLK1 */
    default:
      frequency = __LL_RCC_CALC_PCLK1_FREQ(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), \
        LL_RCC_GetAHBPrescaler()), LL_RCC_GetAPB1Prescaler());
      break;
    }
    break;
    
  case RCC_PERIPHCLK_I2C3:
    
    /* Get the current I2C3 source */
    srcclk = LL_RCC_GetI2CClockSource(LL_RCC_I2C3_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_I2C3_CLKSOURCE_SYSCLK:            /* I2C3 Clock is System Clock */
      frequency = HAL_RCC_GetSysClockFreq();
      break;
      
    case LL_RCC_I2C3_CLKSOURCE_HSI:               /* I2C3 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_I2C3_CLKSOURCE_PCLK1:             /* I2C3 Clock is PCLK1 */
    default:
      frequency = __LL_RCC_CALC_PCLK1_FREQ(__LL_RCC_CALC_HCLK1_FREQ(HAL_RCC_GetSysClockFreq(), \
        LL_RCC_GetAHBPrescaler()), LL_RCC_GetAPB1Prescaler());
      break;
    }
    break;
    
  case RCC_PERIPHCLK_I2S2:
    
    /* Get the current I2S2 source */
    srcclk = LL_RCC_GetI2SClockSource(LL_RCC_I2S2_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_I2S2_CLKSOURCE_PIN:          /* I2S2 Clock is External clock */
      frequency = EXTERNAL_CLOCK_VALUE;
      break;
      
    case LL_RCC_I2S2_CLKSOURCE_HSI:               /* I2S2 Clock is HSI Osc. */
      if (LL_RCC_HSI_IsReady() == 1U)
      {
        frequency = HSI_VALUE;
      }
      break;
      
    case LL_RCC_I2S2_CLKSOURCE_PLL:               /* I2S2 Clock is PLL */
    default:
      frequency = RCC_PLL_GetFreqDomain_Q();
      break;
    }
    break;
    
  case RCC_PERIPHCLK_LPTIM1:
    
    /* Get the current LPTIM1 source */
    srcclk = LL_RCC_GetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE);
    
    switch (srcclk)
    {
    case LL_RCC_LPTIM1_CLKSOURCE_LSI:             /* LPTIM1 Clock is LSI Osc. */
      if (LL_RCC_LSI_IsReady() == 1U)
      {
        if (LL_RCC_LSI_GetPrediv() == LL_RCC_LSI_PREDIV_128)
        {
          frequency = LSI_VALUE / 128U;
        }
        else
        {
          frequency = LSI_VALUE;
        }
      }
      break;
      
